const wordA = ["가느다란", "가련한", "가벼운", "간절한", "강력한", "게으른", "고독한", "고요한", "고풍스러운", "교활한", "구름낀", "귀찮은", "그윽한", "긍정적인", "기묘한", "까다로운", "깔끔한", "깜찍한", "끈질긴", "나른한", "날렵한", "낭만적인", "냉정한", "너그러운", "능글맞은", "늠름한", "다정한", "단호한", "당돌한", "당황한", "독특한", "동글동글한", "두려운", "둔한", "들뜬", "따분한", "똑똑한", "뚱한", "뛰어난", "뜨거운", "맹렬한", "멍청한", "멋진", "명랑한", "못된", "무관심한", "무기력한", "무뚝뚝한", "뭉툭한", "미끄러운", "미묘한", "미심쩍은", "민첩한", "믿음직한", "밉살스러운", "바보같은", "반짝이는", "발랄한", "방탕한", "버릇없는", "변덕스러운", "보송보송한", "부드러운", "부정적인", "불쌍한", "불타는", "뾰족한", "사나운", "사악한", "산뜻한", "상냥한", "새침한", "서운한", "서투른", "성실한", "소심한", "솔직한", "수줍은", "수상한", "신비로운", "심술궂은", "엉뚱한", "엉성한", "에메랄드빛", "영리한", "영롱한", "예민한", "외로운", "우아한", "우직한", "유쾌한", "은밀한", "응큼한", "의심많은", "점잖은", "조용한", "지혜로운", "진지한", "차가운", "투덜거리는"]
const wordB = ["가오리", "가재", "갈매기", "강아지", "개나리", "거북이", "고드름", "고라니", "고양이", "고래", "군만두", "그림자", "기린", "까마귀", "꿀벌", "나무늘보", "너구리", "노트북", "눈사람", "다람쥐", "단무지", "달걀", "당나귀", "도깨비", "도토리", "돌고래", "두더지", "두루미", "드래곤", "등불", "라쿤", "라일락", "레몬", "마법사", "마시멜로", "망고", "머그컵", "메아리", "메추리알", "목도리", "무당벌레", "무지개", "문어", "물망초", "미어캣", "민들레", "바나나", "바다표범", "반딧불이", "밤송이", "방울뱀", "배짱이", "백상아리", "뱀파이어", "뱃사공", "벙어리장갑", "벚꽃", "부엉이", "분무기", "붕어빵", "비둘기", "빗자루", "뻐꾸기", "사과", "사막여우", "산타", "살쾡이", "삼각김밥", "상어", "색소폰", "샌드위치", "생쥐", "선인장", "소라게", "수달", "순록", "솜사탕", "스컹크", "아나콘다", "아메바", "아이스크림", "악어", "양말", "얼룩말", "여우", "오랑우탄", "오리", "옥수수", "올빼미", "왕관", "유니콘", "유령", "은행잎", "의자", "자장가", "족제비", "첼로", "청개구리", "코뿔소", "하마"]

// 무작위 닉네임 생성 함수
function generateNickname() {
    const randomWordA = wordA[Math.floor(Math.random() * wordA.length)];
    const randomWordB = wordB[Math.floor(Math.random() * wordB.length)];
    return randomWordA + " " + randomWordB;
}

export { generateNickname };